---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailIndex.RightPrimary
enum: Autodesk.Revit.DB.Architecture.RailIndex
source: html/c743a6e2-aedc-7320-55b2-bbc8624ec606.htm
---
# Autodesk.Revit.DB.Architecture.RailIndex.RightPrimary

The rail is a primary rail on the right.